tutorials/incompressible/pimpleFoam/RAS/propeller1/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//innerCylinder.obj
//{
//    #include "surfaceFeatureExtractDict.defaults"
//}


//innerCylinderSmall.obj
//{
//    #include "surfaceFeatureExtractDict.defaults"
//}


//outerCylinder.obj
//{
//    #include "surfaceFeatureExtractDict.defaults"
//}


hub.obj
{
    #include "surfaceFeatureExtractDict.defaults"
}


transmission.obj
{
    #include "surfaceFeatureExtractDict.defaults"
}


propeller.obj
{
    #include "surfaceFeatureExtractDict.defaults"
}


// ************************************************************************* //
